In [5]:
import numpy as np
import pandas as pd

a = pd.Series([1,3,5,np.nan,6,8])
a

np_a = np.array([2,4,6,np.nan,8,10])
a1 = pd.Series(np_a)
a1

0     2.0
1     4.0
2     6.0
3     NaN
4     8.0
5    10.0
dtype: float64

In [9]:
dic = {'a':0, 'b':1, 'c':2}
pd.Series(dic)
### Dictionary to Pandas 경우 Dictionary Key가 Index가 된다.

a    0
b    1
c    2
dtype: int64

In [10]:
states = ['Cal','Ohi','Ore','Tex']
sdata = {'Ohi':35000, 'Tex':71000, 'Ore':16000, 'Uta':5000}
b = pd.Series(sdata, index=states)
b
### Index에 포함된 데이터만 적재된다!!

Cal        NaN
Ohi    35000.0
Ore    16000.0
Tex    71000.0
dtype: float64

In [12]:
pd.isnull(b)
b.isnull()

pd.notnull(b)
b.notnull()

## null check or not null check

Cal     True
Ohi    False
Ore    False
Tex    False
dtype: bool

In [41]:
sales_stats={'No':['a','b','c','d','e','f'],'Day':[1,2,3,4,5,6],'Visitors':[43,45,33,43,78,44],'Revenue':[64,73,62,64,53,66]}
df = pd.DataFrame(sales_stats)
df

  No  Day  Visitors  Revenue
0  a    1        43       64
1  b    2        45       73
2  c    3        33       62
3  d    4        43       64
4  e    5        78       53
5  f    6        44       66

In [53]:
## row operation
df.loc['a']
df.loc[:'c']
df.loc['c':]

## col operation
df['Visitors']

## col + row operation
df['Visitors'].loc['c':]
df.loc['c':]['Visitors']

No
c    33
d    43
e    78
f    44
Name: Visitors, dtype: int64

In [44]:
df = df.set_index('No')
df

    Day  Visitors  Revenue
No
a     1        43       64
b     2        45       73
c     3        33       62
d     4        43       64
e     5        78       53
f     6        44       66

In [46]:
df.loc['a']  ## No 컬럼의 값 기준 row 검색
df.iloc[1]  ## index 값 기준 row 검색

Day          2
Visitors    45
Revenue     73
Name: b, dtype: int64

In [59]:
df[df['Visitors']>40]
df[(df['Visitors']>40) | (df['Revenue']>70)]
df[(df['Visitors']>40) & (df['Revenue']>70)]
## Multi-Condition이면 ()로 구분해줘야 함

    Day  Visitors  Revenue
No
b     2        45       73

In [82]:
df[['Visitors','Revenue']]
pd.DataFrame(df, columns=['Visitors','Revenue'])
## column projection은 column list를 넣어줘야 함

    Visitors  Revenue
No
a         43       64
b         45       73
c         33       62
d         43       64
e         78       53
f         44       66

In [104]:
df2 = pd.DataFrame(df, columns=['Visitors','Revenue','Debt'])
## 신규 DataFrame을 만들면서 컬럼추가 가능함, 추가된 컬럼은 NaN 할당
df2

df2 = df2.drop('Debt',axis=1) ## axis=1의 의미는 모든 row에 대해 Debt 값을 삭제한다는 뜻.
## axis=0 이면 모든 column에 대해 삭제
df2

    Visitors  Revenue
No
a         43       64
b         45       73
c         33       62
d         43       64
e         78       53
f         44       66

In [87]:
df2.loc['g'] = [99,99]
df2
## row 추가, index 기준으로 나머지 값을 입력한다 (similar Dictionary)

df2.drop('g', axis=0)
## axis=0의 의미는 모든 column에 대해 g row값을 제거하겠다는 뜻

    Visitors  Revenue
No
a         43       64
b         45       73
c         33       62
d         43       64
e         78       53
f         44       66

In [159]:
newColumns={'Visitors':'NewVisitors','Revenue':'NewRevenue'}
df3 = df2.rename(columns=newColumns)
df3

## column명 변경방법 (dictionary로 일괄 변경해야함)

    NewVisitors  NewRevenue
No
a            43          64
b            45          73
c            33          62
d            43          64
e            78          53
f            44          66

In [160]:
df3 = df3.rename(index={'a':'aa'})
df3
## index명 변경방법 (dictionary로 변경해야 함)

    NewVisitors  NewRevenue
No
aa           43          64
b            45          73
c            33          62
d            43          64
e            78          53
f            44          66

In [117]:
df2[df2['Visitors'] > 50].count()

df2['Revenue'].mean()

df2.cov()

df2['Visitors'].median()

## 기본통계함수 제공됨 (avg, min, max, std, mean, median, var, count 등등)

43.5

In [121]:
df4 = pd.DataFrame(np.array([[1,2,3],[4,5,6],[7,8,9]]), columns=['A','B','C'])

for index, row in df4.iterrows():
    print(index, row['A'],row['B'],row['C'])
    
### loop 돌릴때는 iterrows() 함수를 사용하고, Return값은 index와 row

0 1 2 3
1 4 5 6
2 7 8 9

In [126]:
df5 = pd.DataFrame({
    'A':['f','b','f','b','f','b','f','f'],
    'B':['one','one','two','three','two','two','one','three'],
    'C':np.random.randn(8),
    'D':np.random.randn(8)    
})
grouped = df5.groupby('B')
grouped.mean()
grouped.sum()

## groupby 옵션 사용시 별도의 변수를 groupby에 할당해서 사용한다.

              C         D
B
one    2.404467  2.035048
three -3.085972 -2.313673
two   -1.273504 -2.446887

In [140]:
multi_groupby = df5.groupby(('A','B'))
multi_groupby.sum()
multi_groupby.median()
### multi-condition 조건에서 groupby 확인

grouped.get_group(('one'))
### groupby에서 특정 group의 값을 확인할때 사용

C:\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Interpreting tuple 'by' as a list of keys, rather than a single key. Use 'by=[...]' instead of 'by=(...)'. In the future, a tuple will always mean a single key.
  """Entry point for launching an IPython kernel.

   A         C         D
0  f  1.398793  0.275027
1  b  0.674742  0.689396
6  f  0.330932  1.070625

In [194]:
df3.loc['g'] = [99,99]

result = pd.merge(df,df3, on='No')
result

### merge는 무조건 inner join 이다

pd.merge(df3, df, left_index=True, right_index=False, right_on='No', how='outer')

### merge에서 outer를 하려면 how='outer' 옵션을 사용해야 함

    NewVisitors  NewRevenue  Day  Visitors  Revenue
No
aa         43.0        64.0  NaN       NaN      NaN
b          45.0        73.0  2.0      45.0     73.0
c          33.0        62.0  3.0      33.0     62.0
d          43.0        64.0  4.0      43.0     64.0
e          78.0        53.0  5.0      78.0     53.0
f          44.0        66.0  6.0      44.0     66.0
g          99.0        99.0  NaN       NaN      NaN
a           NaN         NaN  1.0      43.0     64.0

In [197]:
date_str = ["2018,01,01","2018,01,04","2018,01,05","2018,01,06"]
i = pd.to_datetime(date_str)
i

DatetimeIndex(['2018-01-01', '2018-04-01', '2018-05-01', '2018-06-01'], dtype='datetime64[ns]', freq=None)

In [206]:
pd.date_range('2018-01-01','2018-02-01')
pd.date_range(start='2018-01-01', periods=30, freq='B' )
pd.date_range(start='2018-01-01', end='2018-01-07', freq='8h30min' )
### 날짜 자동 생성함수 date_range는 start, end, period, freq(주기) 옵션이 있다

DatetimeIndex(['2018-01-01 00:00:00', '2018-01-01 08:30:00',
               '2018-01-01 17:00:00', '2018-01-02 01:30:00',
               '2018-01-02 10:00:00', '2018-01-02 18:30:00',
               '2018-01-03 03:00:00', '2018-01-03 11:30:00',
               '2018-01-03 20:00:00', '2018-01-04 04:30:00',
               '2018-01-04 13:00:00', '2018-01-04 21:30:00',
               '2018-01-05 06:00:00', '2018-01-05 14:30:00',
               '2018-01-05 23:00:00', '2018-01-06 07:30:00',
               '2018-01-06 16:00:00'],
              dtype='datetime64[ns]', freq='510T')

In [223]:
rng = pd.date_range('2018-01-01', periods=72, freq='H')
rng[:3]
ts = pd.Series(np.random.randn(len(rng)),index=rng)
ts[:3]

ts = ts.truncate(before='2018-01-01',after='2018-01-03')
ts

### truncate 함수를 사용해서 필요없는 부분을 제거할 수 있다

2018-01-01 00:00:00   -0.434922
2018-01-01 01:00:00    0.338621
2018-01-01 02:00:00    1.024155
2018-01-01 03:00:00   -1.348683
2018-01-01 04:00:00   -0.201242
2018-01-01 05:00:00    1.299930
2018-01-01 06:00:00   -0.303051
2018-01-01 07:00:00    2.025747
2018-01-01 08:00:00   -1.155096
2018-01-01 09:00:00   -1.008499
2018-01-01 10:00:00    0.217817
2018-01-01 11:00:00   -1.476611
2018-01-01 12:00:00   -1.233495
2018-01-01 13:00:00    0.742383
2018-01-01 14:00:00   -0.976648
2018-01-01 15:00:00    1.055653
2018-01-01 16:00:00   -1.171312
2018-01-01 17:00:00   -0.203687
2018-01-01 18:00:00    0.272739
2018-01-01 19:00:00    1.015473
2018-01-01 20:00:00    0.212032
2018-01-01 21:00:00   -2.816097
2018-01-01 22:00:00    1.662778
2018-01-01 23:00:00   -0.646229
2018-01-02 00:00:00   -0.120180
2018-01-02 01:00:00   -1.066286
2018-01-02 02:00:00   -1.072534
2018-01-02 03:00:00    0.567862
2018-01-02 04:00:00    0.396613
2018-01-02 05:00:00    0.771578
2018-01-02 06:00:00   -0.078211
2018-01-02 07:00:00    0.397671
2018-01-02 08:00:00    1.761603
2018-01-02 09:00:00   -0.243049
2018-01-02 10:00:00   -0.141515
2018-01-02 11:00:00   -0.712668
2018-01-02 12:00:00   -1.696798
2018-01-02 13:00:00   -0.342152
2018-01-02 14:00:00    1.580263
2018-01-02 15:00:00    1.106155
2018-01-02 16:00:00    0.224600
2018-01-02 17:00:00    0.702517
2018-01-02 18:00:00    0.278237
2018-01-02 19:00:00    1.313501
2018-01-02 20:00:00    0.411717
2018-01-02 21:00:00   -2.573196
2018-01-02 22:00:00   -0.655514
2018-01-02 23:00:00    0.570843
2018-01-03 00:00:00   -1.259309
Freq: H, dtype: float64